In [1]:
import pandas as pd

In [2]:
covid = pd.read_csv('../data/nyt_county.csv')

In [4]:
print(covid.shape)
covid.head()

(1381436, 6)

,date,county,state_name,county_fips_code,confirmed_cases,deaths
0,2021-02-19,Bristol,Rhode Island,44001.0,4115,123.0
1,2021-02-19,Kent,Rhode Island,44003.0,14896,291.0
2,2021-02-19,Providence,Rhode Island,44007.0,80264,1730.0
3,2021-02-19,Chittenden,Vermont,50007.0,4590,83.0
4,2021-02-20,Apache,Arizona,4001.0,10244,365.0

In [3]:
census = pd.read_csv('../data/census_data_2018.csv')

In [5]:
print(census.shape)
census.head()

(3220, 242)

,geo_id,do_date,total_pop,households,male_pop,female_pop,median_age,male_under_5,male_5_to_9,male_10_to_14,...,management_business_sci_arts_employed,sales_office_employed,in_grades_1_to_4,in_grades_5_to_8,in_grades_9_to_12,in_school,in_undergrad_college,speak_only_english_at_home,speak_spanish_at_home,speak_spanish_at_home_low_english
0,35039,2014-01-01,39307,12398,19250,20057,40.6,1224,1240,1278,...,NaN,NaN,2170,1985,1970,9260,1653,NaN,NaN,NaN
1,72133,2014-01-01,22066,7465,10650,11416,37.8,567,662,864,...,2171.0,1242.0,1155,1362,1319,5884,1410,NaN,NaN,NaN
2,72043,2014-01-01,39265,13346,19056,20209,40.7,945,1109,1431,...,3023.0,2529.0,1851,2144,1901,9475,2219,NaN,NaN,NaN
3,72151,2014-01-01,34149,11722,16541,17608,42.5,754,1095,1020,...,1969.0,1700.0,1957,1388,1933,8055,2147,NaN,NaN,NaN
4,72071,2014-01-01,42420,15012,20629,21791,41.6,898,1159,1381,...,3246.0,2725.0,1996,2057,2211,10099,2551,NaN,NaN,NaN

In [16]:
by_county = covid.groupby('county_fips_code').max()

In [18]:
census.set_index('geo_id', inplace=True)

In [20]:
df = pd.merge(by_county, census, left_index = True, right_index=True)

In [21]:
print('by_county df:', by_county.shape)
print('census df:', census.shape)
print('final df:', df.shape)

by_county df: (3218, 5)
census df: (3220, 241)
final df: (3211, 246)

In [22]:
df

,date,county,state_name,confirmed_cases,deaths,do_date,total_pop,households,male_pop,female_pop,...,management_business_sci_arts_employed,sales_office_employed,in_grades_1_to_4,in_grades_5_to_8,in_grades_9_to_12,in_school,in_undergrad_college,speak_only_english_at_home,speak_spanish_at_home,speak_spanish_at_home_low_english
1001,2021-06-02,Autauga,Alabama,7161,111.0,2014-01-01,55200,21115,26874,28326,...,9336.0,5331.0,3009,2823,3245,13435,1865,NaN,NaN,NaN
1003,2021-06-02,Baldwin,Alabama,21674,311.0,2014-01-01,208107,78622,101188,106919,...,33923.0,22509.0,9861,11627,10456,45076,6674,NaN,NaN,NaN
1005,2021-06-02,Barbour,Alabama,2340,59.0,2014-01-01,25782,9186,13697,12085,...,2261.0,1729.0,1106,1280,1424,5216,704,NaN,NaN,NaN
1007,2021-06-02,Bibb,Alabama,2666,64.0,2014-01-01,22527,6840,12152,10375,...,1775.0,1531.0,922,1154,1169,4424,757,NaN,NaN,NaN
1009,2021-06-02,Blount,Alabama,6889,139.0,2014-01-01,57645,20600,28434,29211,...,6385.0,4569.0,3064,2998,3180,12220,1718,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72145,2021-06-02,Vega Baja,Puerto Rico,3442,NaN,2014-01-01,53371,18081,25580,27791,...,4179.0,3476.0,2280,3023,2658,12419,2978,NaN,NaN,NaN
72147,2021-06-02,Vieques,Puerto Rico,205,NaN,2014-01-01,8771,2470,4332,4439,...,609.0,423.0,435,441,248,1497,163,NaN,NaN,NaN
72149,2021-06-02,Villalba,Puerto Rico,878,NaN,2014-01-01,22993,7712,11169,11824,...,1578.0,1388.0,1175,1102,1496,6008,1618,NaN,NaN,NaN
72151,2021-06-02,Yabucoa,Puerto Rico,1392,NaN,2014-01-01,34149,11722,16541,17608,...,1969.0,1700.0,1957,1388,1933,8055,2147,NaN,NaN,NaN
72153,2021-06-02,Yauco,Puerto Rico,1255,NaN,2014-01-01,36439,10790,17475,18964,...,3077.0,2085.0,1548,1588,2016,8494,2355,NaN,NaN,NaN